<script setup>
import Header from "./components/header.vue";
import AnimationDiff from "./components/animation-diff.vue";
import Bottle from "./components/bottle.vue";
</script>

<template>
  <Header />
  <section class="split-field">
    <div><AnimationDiff /></div>
    <div>
      <p>
        Визуализация отражает процесс диффузии — постепенное смешивание красных
        и синих частиц, символизирующих молекулы разных веществ. При повышении
        температуры частицы начинают двигаться быстрее, сталкиваются чаще и
        активнее заполняют всё пространство, постепенно теряя первоначальную
        границу. Это демонстрирует прямую зависимость интенсивности диффузии от
        температуры: чем выше тепло, тем энергичнее движение молекул и тем
        быстрее они перемешиваются.
      </p>
      <img src="./assets/formula.png" alt="#" />
    </div>
  </section>
  <section class="text-field">
    <h1>
      Совместимость металлов и значение сплавов в современной промышленности
    </h1>
    <p>
      Совместимость металлов играет ключевую роль в металлургии, поскольку от
      неё зависит качество, структура и свойства получаемого сплава. Если
      металлы хорошо растворяются друг в друге, они образуют прочные и
      однородные соединения с улучшенными характеристиками. Например, добавление
      хрома и никеля к железу создаёт нержавеющую сталь, устойчивую к ржавчине и
      высоким температурам. Сплав меди с оловом даёт бронзу — твёрдый и
      износостойкий материал, применяемый в механизмах и декоративных изделиях.
      <br /><br />
      Совместимые металлы позволяют регулировать электрическую и
      теплопроводность, плотность, твердость и даже цвет готового материала. Это
      делает сплавы незаменимыми в авиастроении, медицине, энергетике и
      микроэлектронике. Таким образом, подбор совместимых металлов — не просто
      технологический процесс, а искусство, где баланс свойств определяет
      эффективность и долговечность будущего изделия.
    </p>
  </section>
  <section class="split-field">
    <div style="color: var(--color-300); background-color: var(--color-800)">
      <p>
        Однако не все металлы совместимы между собой. При неправильном сочетании
        могут образовываться хрупкие соединения, увеличиваться коррозионная
        активность или возникать внутренние напряжения в структуре материала.
        Такие сплавы теряют прочность и пластичность, становятся менее
        долговечными и непригодными для ответственных конструкций. В
        промышленности это приводит к преждевременному износу деталей, поломкам
        оборудования, авариям и значительным затратам на ремонт и замену, что
        делает контроль совместимости металлов критически важным.
      </p>
    </div>
    <div><Bottle /></div>
  </section>
</template>

<style scoped>
.split-field {
  display: flex;
  justify-content: space-between;
}

.split-field > div {
  flex-basis: 50%;
  padding: 50px;
}

.split-field > div p {
  font-size: 18px;
  line-height: 1.7;
  color: var(--color-300);
}

.split-field > div:nth-child(2) {
  display: flex;
  flex-direction: column;
  gap: 20px;
  background-color: var(--color-800);
}

.text-field {
  padding: 50px;
  background-color: var(--color-800);
  border-top: 5px solid var(--color-600);
}

.text-field p {
  font-size: 18px;
  line-height: 1.7;
  color: var(--color-300);
}

.text-field h1 {
  font-size: 35px;
  margin-bottom: 40px;
  color: #fff;
}
</style>
